//ДвухзначноеЧисло = 10;
//Степень = 5;
//Результат = 1;

//Для Счетчик = 1 По Степень Цикл
//	
//	Результат = Результат * ДвухзначноеЧисло;
//	
//КонецЦикла;

//Сообщить(Результат);

//Если Результат > 10000 Тогда 
//	
//	Сообщить("Превышает порог в 10000");

//Иначе 
//	
//	Сообщить("Не превышает порог в 10000");
//	
//КонецЕсли;   

//А = КонецГода(ТекущаяДата());

//Для Итератор = 1 По 10 Цикл
//	
//	ДеньНедели = ДеньНедели(А);
//	
//	Если ДеньНедели = 1 Тогда
//		Сообщить("Понедельник");
//	ИначеЕсли ДеньНедели = 2 Тогда
//		Сообщить("Вторник");
//	ИначеЕсли ДеньНедели = 3 Тогда
//		Сообщить("Среда");
//	ИначеЕсли ДеньНедели = 4 Тогда
//		Сообщить("Четверг");
//	ИначеЕсли ДеньНедели = 5 Тогда
//		Сообщить("Пятница");
//	ИначеЕсли ДеньНедели = 6 Тогда
//		Сообщить("Суббота");
//	Иначе 
//		Сообщить("Воскресенье")      
//	КонецЕсли;
//	
//	А = КонецГода(КонецДня(А)+1);
//	
//КонецЦикла;

Массив = Новый Массив();
//Сообщить(Массив.Количество());
Массив.Добавить(1);
Массив.Добавить(3);
//Сообщить(Массив.Количество());
Для Каждого Номер ИЗ Массив Цикл
	
	Сообщить(Номер);

КонецЦикла;
