
&НаКлиенте
Процедура ТоварЦенаПриИзменении(Элемент)
	// Вставить содержимое обработчика.
	Элементы.Товар.ТекущиеДанные.Сумма = Элементы.Товар.ТекущиеДанные.Цена * Элементы.Товар.ТекущиеДанные.Количество;
КонецПроцедуры

&НаКлиенте
Процедура ТоварКоличествоПриИзменении(Элемент)
	// Вставить содержимое обработчика.
	Элементы.Товар.ТекущиеДанные.Сумма = Элементы.Товар.ТекущиеДанные.Цена * Элементы.Товар.ТекущиеДанные.Количество;
КонецПроцедуры

&НаКлиенте
Процедура ТоварСуммаПриИзменении(Элемент)
		ТекущиеДанные = Элементы.Товар.ТекущиеДанные;
	Если ТекущиеДанные.Количество = 0 Тогда
		ТекущиеДанные.Цена = 0;
	Иначе
		ТекущиеДанные.Цена = ТекущиеДанные.Сумма / ТекущиеДанные.Количество; 
	КонецЕсли;

КонецПроцедуры
